Config/Documents/DebitNote.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>DebitNote</Name>
			<BasedOn>
				<xr:Item>Catalog.Customers</xr:Item>
				<xr:Item>Catalog.Contracts</xr:Item>
				<xr:Item>Catalog.GuestGroups</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.PaymentServices</xr:Item>
				<xr:Item>AccumulationRegister.InvoiceAccounts</xr:Item>
				<xr:Item>AccumulationRegister.AccountsReceivable</xr:Item>
				<xr:Item>AccumulationRegister.Accounts</xr:Item>
				<xr:Item>AccumulationRegister.Payments</xr:Item>
				<xr:Item>AccumulationRegister.CurrentAccountsReceivable</xr:Item>
				<xr:Item>AccumulationRegister.CustomerAccounts</xr:Item>
				<xr:Item>AccountingRegister.PostingsFO</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Hotel</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Hotels</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Company</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Companies</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>BankAccount</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.BankAccounts</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>AccountingCustomer</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Customers</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>AccountingContract</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Contracts</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>AccountingCurrency</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Currencies</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>GuestGroup</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.GuestGroups</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Remarks</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>RemarksForPrinting</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Author</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Employees</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ExternalCode</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CorrectionSum</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>VATRate</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.VATRates</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CheckDate</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IsChecked</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DoNotExportToTheAccountingSystem</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DoNotExportToTheExternalSystem</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>PaymentMethod</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.PaymentMethods</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>PaymentSection</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.PaymentSections</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ChangeDate</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ChangeAuthor</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Employees</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Invoice</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Settlement</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CloseOfPeriod</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.CloseOfPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Invoices</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Invoice</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.Settlement</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>InvoiceSum</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>17</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Sum</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>17</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>CorrectionSum</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>17</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>CorrectionVATSum</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>17</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Services</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Client</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Clients</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Room</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Rooms</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>AccommodationType</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.AccommodationTypes</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Resource</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Resources</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>NumberOfPersons</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>6</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>AccountingDate</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Service</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Services</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Price</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>17</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Unit</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Quantity</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>7</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Sum</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>17</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>VATRate</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.VATRates</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>VATSum</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>17</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Remarks</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>IsInPrice</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>IsRoomRevenue</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>IsResourceRevenue</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Customer</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Customers</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Contract</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Contracts</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>GuestGroup</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.GuestGroups</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>FolioCurrency</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Currencies</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Folio</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.Folio</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ParentDoc</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.Accommodation</v8:Type>
								<v8:Type>cfg:DocumentRef.SetRoomQuota</v8:Type>
								<v8:Type>cfg:DocumentRef.Reservation</v8:Type>
								<v8:Type>cfg:DocumentRef.ResourceReservation</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Charge</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.Charge</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>CalendarDayType</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.CalendarDayTypes</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Agent</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Customers</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>AgentCommissionType</Name>
							<Type>
								<v8:Type>cfg:EnumRef.AgentCommissionTypes</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>AgentCommission</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>6</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>CommissionSum</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>17</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>VATCommissionSum</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>17</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>HotelProduct</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.HotelProducts</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Config/Documents/DebitNote/Forms/tcListForm/Ext/Form/Module.bsl
#Region FormEventHandlers

// -----------------------------------------------------------------------------
&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	If Parameters.Property("AvtoTest") Then
		If Parameters.AvtoTest Then
			Return;
		EndIf;	
	EndIf;
	// Let's set the properties of the form
	tcProtection.SetFormProperties(ThisObject);

	If Parameters.Property("FillingValues") And Parameters.FillingValues.Count() > 0 Then
		Filling(Parameters.FillingValues);
	Else	
		SelPeriod = '00010101';
	EndIf;
	If ValueIsFilled(SessionParameters.CurrentUser) And ValueIsFilled(SessionParameters.CurrentUser.Customer) Then
		SelCustomer = SessionParameters.CurrentUser.Customer;
		AttributeChangeAtServer("AccountingCustomer", SelCustomer);
		Items.SelCustomer.ReadOnly = True;
		Items.SelCustomer.ChoiceButton = False;
		Items.SelCustomer.ClearButton = False;
		Items.SelCustomer.OpenButton = False;
	EndIf;
	If Parameters.Property("SelHotel") Then
		SelHotel = Parameters.SelHotel;
	Else
		SelHotel = SessionParameters.CurrentHotel;
	EndIf;
	If Parameters.Property("SelCustomer") Then
		SelCustomer = Parameters.SelCustomer;
		If ValueIsFilled(SelCustomer) Then
			AttributeChangeAtServer("AccountingCustomer", SelCustomer);
		EndIf;
	EndIf;
	If Parameters.Property("SelContract") Then
		SelContract = Parameters.SelContract;
		If ValueIsFilled(SelContract) Then
			AttributeChangeAtServer("AccountingContract", SelContract);
		EndIf;
	EndIf;
	If Parameters.Property("SelGuestGroup") Then
		SelGuestGroup = Parameters.SelGuestGroup;
		If ValueIsFilled(SelGuestGroup) Then
			If SelGuestGroup.Owner <> SelHotel Then
				SelHotel = SelGuestGroup.Owner;
			EndIf;
		EndIf;
	EndIf;
	If Parameters.Property("SelPeriod") Then
		SelPeriod = Parameters.SelPeriod;
		If ValueIsFilled(SelPeriod) Then
			AttributeChangeAtServer("Date", SelPeriod);
		EndIf;
	EndIf;
	If Not Parameters.Property("SelCustomer") And Not Parameters.Property("SelGuestGroup") And Not Parameters.Property("SelPeriod") Then
		SelPeriod = BegOfDay(CurrentSessionDate()) - 24 * 3600;
		AttributeChangeAtServer("Date", SelPeriod);
	EndIf;
	If Parameters.Property("ChoiceMode") Then
		Items.List.ChoiceMode = Parameters.ChoiceMode;
	EndIf;
	// Set hotel color          
	Items.GroupHotel.BackColor = CachedCommonFunctions.cmGetColorByColorStringFromRef(SelHotel, "BackgroundColorImportant");
	SetParametersDinamicList();
	FillPrintingButton();
EndProcedure // OnCreateAtServer

// -----------------------------------------------------------------------------
&AtClient
Procedure NotificationProcessing(EventName, Parameter, Source)
	If EventName = "System.Hotel.Changed" And Parameter <> SelHotel Then
		SetParametersDinamicList();
		RefreshDataRepresentation();
	ElsIf EventName = "Subsystem.Accounts.Changed" Then
		SetParametersDinamicList();
		RefreshDataRepresentation();
	EndIf;
EndProcedure

#EndRegion

#Region FormHeaderItemsEventHandlers

// -----------------------------------------------------------------------------
&AtClient
Procedure SelCustomerOnChange(pItem)
	If ValueIsFilled(SelCustomer) Then
		AttributeChangeAtServer("AccountingCustomer", SelCustomer);
	Else
		SelCustomerClearing(pItem, True);
	EndIf;
EndProcedure

// -----------------------------------------------------------------------------
&AtClient
Procedure SelCustomerClearing(pItem, pStandardProcessing)
	ClearingAttributeAtServer("AccountingCustomer");
EndProcedure

// -----------------------------------------------------------------------------
&AtClient
Procedure SelContractOnChange(pItem)
	If ValueIsFilled(SelContract) Then
		AttributeChangeAtServer("AccountingContract", SelContract);
	Else
		SelContractClearing(pItem, True);
	EndIf;
EndProcedure

// -----------------------------------------------------------------------------
&AtClient
Procedure SelContractClearing(pItem, pStandardProcessing)
	ClearingAttributeAtServer("AccountingContract");
EndProcedure

// -----------------------------------------------------------------------------
&AtClient
Procedure SelGuestGroupOnChange(pItem)
	SelGuestGroupOnChangeAtServer();
EndProcedure

// -----------------------------------------------------------------------------
&AtClient
Procedure SelGuestGroupClearing(pItem, pStandardProcessing)
	ClearingAttributeAtServer("GuestGroup");
EndProcedure

// -----------------------------------------------------------------------------
&AtClient
Procedure SelPeriodClearing(pItem, pStandardProcessing)
	ClearingAttributeAtServer("Date");
	ClearingAttributeAtServer("ChangeDate");
EndProcedure

// -----------------------------------------------------------------------------
&AtClient
Procedure SelPeriodOnChange(pItem)
	If ValueIsFilled(SelPeriod) Then
		If SelFilterChangeDate Then
			ClearingAttributeAtServer("Date");
			AttributeChangeAtServer("ChangeDate", BegOfDay(SelPeriod));
		Else
			ClearingAttributeAtServer("ChangeDate");
			AttributeChangeAtServer("Date", BegOfDay(SelPeriod));
		EndIf;
	Else
		SelPeriodClearing(pItem, True);
	EndIf;
EndProcedure

// -----------------------------------------------------------------------------
&AtClient
Procedure SelFilterChangeDateOnChange(pItem)
	SelPeriodOnChange(Items.SelPeriod);
EndProcedure

// -----------------------------------------------------------------------------
&AtClient
Procedure ListSelection(pItem, pSelectedRow, pField, pStandardProcessing)
	If Not Items.List.ChoiceMode Then
		If pField.Name = "GuestGroup" Then
			pStandardProcessing = False;
			vRowData = Items.List.RowData(pSelectedRow);
			If ValueIsFilled(vRowData.GuestGroup) Then
				OpenForm("Catalog.GuestGroups.Form.tcItemForm", New Structure("Key", vRowData.GuestGroup));
			EndIf;
		ElsIf pField.Name = "IsChecked" Then
			pStandardProcessing = False;
			vRowData = Items.List.RowData(pSelectedRow);
			If ValueIsFilled(vRowData.Ref) Then
				If Not vRowData.DeletionMark Then
					UpdateInvoiceIsCheckedFlagAtServer(vRowData.Ref);
					Items.List.Refresh();
				Else
					tcCommonFunctionOnClientServer.TextMessage(NStr("en='Invoice is marked for deletion!'; ru='Акт помечен на удаление!'; de='Rechnung ist zum Löschen vorgemerkt!'"));
				EndIf;
			EndIf;
		EndIf;
	Else
		vRowData = Items.List.RowData(pSelectedRow);
		NotifyChoice(vRowData.Ref);
	EndIf;
EndProcedure // ListSelection

#EndRegion

#Region FormCommandsEventHandlers

// -----------------------------------------------------------------------------
&AtClient
Procedure PrintButtonClick(pCommand)
	vInvoices = New ValueList();
	For Each vSelRow In Items.List.SelectedRows Do
		vInvoices.Add(vSelRow);
	EndDo;
	// Choose processing type
	vPrintNumber = StrReplace(pCommand.Name,"Print","");
	vPrintForm = GetPrintFormForNumber(vPrintNumber);
	// Load external print form
		vPrintFormType = "";
		If Left(vPrintForm.PredefinedDataName, 22) = "SettlementPrintInvoice" Then
			vPrintFormType = "Invoice";
		ElsIf Left(vPrintForm.PredefinedDataName, 25) = "SettlementPrintSettlement" Then
			vPrintFormType =  "Settlement";
		ElsIf Left(vPrintForm.PredefinedDataName, 25) = "SettlementPrintVATInvoice" Then
			vPrintFormType =  "VATInvoice";
		ElsIf Left(vPrintForm.PredefinedDataName, 17) = "SettlementPrint7G" Then
			vPrintFormType =  "Settlement7G";
		ElsIf vPrintForm.PredefinedDataName = "SettlementPrintHotelProducts" Then
			vPrintFormType =  "SettlementHotelProduct";
		EndIf;
		If vInvoices.Count() > 1 Then
			OpenForm("Document.Settlement.Form.tcInvoicePrintForm", New Structure("Invoices, Language, PrintForm, PrintFormType", vInvoices, vPrintForm.Language, vPrintForm.Ref, vPrintFormType), ThisObject);
		ElsIf vInvoices.Count() = 1 Then 
			OpenForm("Document.Settlement.Form.tcInvoicePrintForm", New Structure("Invoice, Language, PrintForm, PrintFormType", vInvoices.Get(0).Value, vPrintForm.Language, vPrintForm.Ref, vPrintFormType), ThisObject);	
		EndIf;
EndProcedure

// -----------------------------------------------------------------------------
&AtClient
Procedure BulkCheckOfInvoices(pCommand)
	OpenForm("Document.Settlement.Form.tcBulkCheckOfInvoices", , ThisObject);
EndProcedure // BulkCheckOfInvoices

#EndRegion

#Region Private

// -----------------------------------------------------------------------------
&AtServer
Procedure SetParametersDinamicList()
	// Set default parameters
	List.Parameters.SetParameterValue("qHotel", SelHotel);
	List.Parameters.SetParameterValue("qGuestGroup", SelGuestGroup);
	Title = NStr("en='Debit notes: '; ru='Дебетовые корректировки: '; de='Lastschriften: '") + ?(ValueIsFilled(SelHotel), Catalogs.Hotels.pmGetHotelPrintName(SelHotel, SessionParameters.CurrentLanguage), "");
EndProcedure //  SetParametersDinamicList()

// -----------------------------------------------------------------------------
&AtServer
Procedure Filling(pParameters)
	If pParameters.Property("SelPeriod") Then
		SelPeriod = pParameters.SelPeriod;
		If ValueIsFilled(SelPeriod) Then 
			AttributeChangeAtServer("Date", BegOfDay(SelPeriod));	
		EndIf;	
	EndIf;	
	If pParameters.Property("SelGuestGroup") Then
		SelGuestGroup = pParameters.SelGuestGroup;
	EndIf;	
	If pParameters.Property("SelCustomer") Then
		SelCustomer = pParameters.SelCustomer;
		AttributeChangeAtServer("AccountingCustomer", SelCustomer);
	EndIf;	
EndProcedure //  Filling()

// -----------------------------------------------------------------------------
&AtServer
Procedure AttributeChangeAtServer(pAttribute, pValue, pComparisonType = Undefined)
	vComparisonType = ?(pComparisonType=Undefined, DataCompositionComparisonType.Equal, pComparisonType);
	vValue = pValue;	
	If ValueIsFilled(vValue) Then
		vFilter = List.Filter;
		vField = New DataCompositionField(pAttribute);
		If vFilter.Items.Count()=0 Then	
			vFilterItem = vFilter.Items.Add(Type("DataCompositionFilterItem"));
			vFilterItem.LeftValue = vField;
			vFilterItem.ComparisonType = vComparisonType;
			vFilterItem.RightValue = vValue;
			vFilterItem.Use = True;
		Else
			// Find field
			vCancel = False;
			For Each int In vFilter.Items Do
				If  int.LeftValue = vField  Then
					// Field delete
					vFilter.Items.Delete(int);	
					// Add a new
					vFilterItem = vFilter.Items.Add(Type("DataCompositionFilterItem"));
					vFilterItem.LeftValue = vField;
					vFilterItem.ComparisonType = vComparisonType;
					vFilterItem.RightValue = vValue;
					vFilterItem.Use = True;
					vCancel = True;
					Break;
				EndIf;	
			EndDo;
			If Not vCancel Then
				// The field is not found, we add a new
				vFilterItem = vFilter.Items.Add(Type("DataCompositionFilterItem"));
				vFilterItem.LeftValue = vField;
				vFilterItem.ComparisonType = vComparisonType;
				vFilterItem.RightValue = vValue;
				vFilterItem.Use = True;
			EndIf;
		EndIf;
	EndIf;
	Items.List.Refresh();
EndProcedure

// -----------------------------------------------------------------------------
&AtServer
Procedure ClearingAttributeAtServer(pAttribute)
	vFilter = List.Filter;
	vValue = New DataCompositionField(pAttribute);
	For Each int In vFilter.Items Do
		If int.LeftValue = vValue Then
			// Field delete
			vFilter.Items.Delete(int);	
			// Refresh page
			Items.List.Refresh();
			Break;
		EndIf;	
	EndDo;
EndProcedure

// -----------------------------------------------------------------------------
&AtServer
Procedure SelGuestGroupOnChangeAtServer()
	SetParametersDinamicList();
EndProcedure // SelGuestGroupOnChangeAtServer

// -----------------------------------------------------------------------------
&AtServerNoContext
Procedure UpdateInvoiceIsCheckedFlagAtServer(pInvoice)
	vInvObj = pInvoice.GetObject();
	vInvObj.IsChecked = Not vInvObj.IsChecked;
	If Not ValueIsFilled(vInvObj.ChangeDate) And ValueIsFilled(vInvObj.Date) Then
		vInvObj.ChangeDate = vInvObj.Date;
	Else
		vInvObj.ChangeDate = CurrentSessionDate();
	EndIf;
	vInvObj.ChangeAuthor = SessionParameters.CurrentUser;
	If Not vInvObj.Posted Then
		vInvObj.Write(DocumentWriteMode.Posting);
	Else
		vInvObj.Write(DocumentWriteMode.Write);
	EndIf;
EndProcedure // UpdateInvoiceIsCheckedFlagAtServer

// -----------------------------------------------------------------------------
&AtServer
Procedure FillPrintingButton()
	vQuery = New Query;
	vQuery.Text = 
	"SELECT
	|	ObjectPrintingForms.Ref,
	|	ObjectPrintingForms.Code AS Code,
	|	ObjectPrintingForms.PredefinedDataName,
	|	ObjectPrintingForms.IsDefault AS IsDefault,
	|	ObjectPrintingForms.Language AS Language
	|FROM
	|	Catalog.ObjectPrintingForms AS ObjectPrintingForms
	|WHERE
	|	NOT ObjectPrintingForms.DeletionMark
	|	AND ObjectPrintingForms.IsActive = TRUE
	|	AND ObjectPrintingForms.ObjectType = &ObjectType
	|
	|ORDER BY
	|	IsDefault DESC,
	|	Code
	|TOTALS BY
	|	Language";
	
	vQuery.SetParameter("ObjectType", Documents.DebitNote.EmptyRef());	
	QueryResult = vQuery.Execute();	
	vSel = QueryResult.Select(QueryResultIteration.ByGroups);
	PrintForms.Clear();
	vLang = SessionParameters.CurrentLanguage;
	While vSel.Next() Do
		vSelDetails = vSel.Select(QueryResultIteration.ByGroups);
		
		If vLang = vSel.Language Or not ValueIsFilled(vSel.Language) Then
			vParentLang = Items.FormGroupPrintingNotDefaultMain;
		ElsIf Not vLang = vSel.Language Then
			vParentLang = tcOnServer.cmCreateItem(ThisObject, Items.FormGroupPrintingNotDefaultExtra, "Print" + vSel.Language, "FormGroup",
												  New Structure("Type, Title", FormGroupType.Popup, vSel.Language));
		EndIf;
		
		While vSelDetails.Next() Do
			vNewRow = PrintForms.Add();
			vNewRow.PrintForm = vSelDetails.Ref;
			vNewRow.IsDefault = vSelDetails.IsDefault;
			
			vID = vNewRow.GetID();
			
			vCommand = Commands.Add("Print" + vID);
			vCommand.Action = "PrintButtonClick";
			If vSelDetails.IsDefault Then
				vParent = Items.FormGroupPrintingDefault;
			Else
				vParent = vParentLang;
			EndIf;
			vStructure = New Structure("Title, CommandName", TrimAll(vSelDetails.Code) + " " + cmNStr(vSelDetails.ref), "Print" + vID);
			        
			tcOnServer.cmCreateItem(ThisObject, vParent, "Print" + vID, "FormButton", vStructure);
		EndDo;
	EndDo;
EndProcedure

// -----------------------------------------------------------------------------
&AtServer
Function GetPrintFormForNumber(pActionsNumber)
	vPrintForms = PrintForms.FindByID(Number(pActionsNumber)).PrintForm;
	
	vStruct = New Structure();
	vStruct.Insert("Ref", vPrintForms);
	vStruct.Insert("PredefinedDataName", vPrintForms.PredefinedDataName);	
	vStruct.Insert("ExternalProcessing", vPrintForms.ExternalProcessing);
	vStruct.Insert("Report", vPrintForms.Report);
	vStruct.Insert("Language", vPrintForms.Language);
	
	Return vStruct;
EndFunction // GetPrintFormForNumber

#EndRegion
